1) /Users/julien/repos/gridonic/web/win-and-donic/src/Entity/User.php:42    [M] TrueValue
--- Original
+++ New
@@ @@
-        $this->isActive = true;
+        $this->isActive = false;

PHPUnit 5.7.25 by Sebastian Bergmann and contributors.



Time: 168 ms, Memory: 6.00MB

No tests executed!

2) /Users/julien/repos/gridonic/web/win-and-donic/src/Entity/User.php:47    [M] PublicVisibility

--- Original
+++ New
@@ @@
-    public function getUsername()
+    protected function getUsername()

3) /Users/julien/repos/gridonic/web/win-and-donic/src/Entity/User.php:52    [M] PublicVisibility

--- Original
+++ New
@@ @@
-    public function getSalt()
+    protected function getSalt()

4) /Users/julien/repos/gridonic/web/win-and-donic/src/Entity/User.php:59    [M] PublicVisibility

--- Original
+++ New
@@ @@
-    public function getPassword()
+    protected function getPassword()

5) /Users/julien/repos/gridonic/web/win-and-donic/src/Entity/User.php:64    [M] PublicVisibility

--- Original
+++ New
@@ @@
-    public function getRoles()
+    protected function getRoles()

6) /Users/julien/repos/gridonic/web/win-and-donic/src/Entity/User.php:69    [M] PublicVisibility

--- Original
+++ New
@@ @@
-    public function eraseCredentials()
+    protected function eraseCredentials()

7) /Users/julien/repos/gridonic/web/win-and-donic/src/Entity/User.php:76    [M] FunctionCall

--- Original
+++ New
@@ @@
-        return serialize(array($this->id, $this->username, $this->password));
+        serialize(array($this->id, $this->username, $this->password));
+        return null;

8) /Users/julien/repos/gridonic/web/win-and-donic/src/Entity/User.php:74    [M] PublicVisibility

--- Original
+++ New
@@ @@
-    public function serialize()
+    protected function serialize()

9) /Users/julien/repos/gridonic/web/win-and-donic/src/Entity/User.php:86    [M] PublicVisibility

--- Original
+++ New
@@ @@
-    public function unserialize($serialized)
+    protected function unserialize($serialized)

10) /Users/julien/repos/gridonic/web/win-and-donic/src/Controller/ScoreApiController.php:21    [M] NewObject

--- Original
+++ New
@@ @@
-        return new JsonResponse(array('hello' => 'world'));
+        new JsonResponse(array('hello' => 'world'));
+        return null;

11) /Users/julien/repos/gridonic/web/win-and-donic/src/Controller/ScoreApiController.php:19    [M] PublicVisibility

--- Original
+++ New
@@ @@
-    public function submitScore()
+    protected function submitScore()

12) /Users/julien/repos/gridonic/web/win-and-donic/src/Controller/MainController.php:16    [M] PublicVisibility

--- Original
+++ New
@@ @@
-    public function index()
+    protected function index()

14) /Users/julien/repos/gridonic/web/win-and-donic/src/Kernel.php:17    [M] PublicVisibility

--- Original
+++ New
@@ @@
-    public function getCacheDir()
+    protected function getCacheDir()

15) /Users/julien/repos/gridonic/web/win-and-donic/src/Kernel.php:22    [M] PublicVisibility

--- Original
+++ New
@@ @@
-    public function getLogDir()
+    protected function getLogDir()

16) /Users/julien/repos/gridonic/web/win-and-donic/src/Kernel.php:31    [M] LogicalOr

--- Original
+++ New
@@ @@
-            if (isset($envs['all']) || isset($envs[$this->environment])) {
+            if (isset($envs['all']) && isset($envs[$this->environment])) {

17) /Users/julien/repos/gridonic/web/win-and-donic/src/Kernel.php:30    [M] Foreach_

--- Original
+++ New
@@ @@
-        foreach ($contents as $class => $envs) {
+        foreach (array() as $class => $envs) {

18) /Users/julien/repos/gridonic/web/win-and-donic/src/Kernel.php:27    [M] PublicVisibility

--- Original
+++ New
@@ @@
-    public function registerBundles()
+    protected function registerBundles()

19) /Users/julien/repos/gridonic/web/win-and-donic/src/Kernel.php:39    [M] TrueValue

--- Original
+++ New
@@ @@
-        $container->setParameter('container.autowiring.strict_mode', true);
+        $container->setParameter('container.autowiring.strict_mode', false);

20) /Users/julien/repos/gridonic/web/win-and-donic/src/Kernel.php:40    [M] TrueValue

--- Original
+++ New
@@ @@
-        $container->setParameter('container.dumper.inline_class_loader', true);
+        $container->setParameter('container.dumper.inline_class_loader', false);

21) /Users/julien/repos/gridonic/web/win-and-donic/src/Kernel.php:37    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
-    protected function configureContainer(ContainerBuilder $container, LoaderInterface $loader)
+    private function configureContainer(ContainerBuilder $container, LoaderInterface $loader)

22) /Users/julien/repos/gridonic/web/win-and-donic/src/Kernel.php:50    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
-    protected function configureRoutes(RouteCollectionBuilder $routes)
+    private function configureRoutes(RouteCollectionBuilder $routes)
